dinhthong/stm32f4_quad_utils_projects/devo7/code_RC_devo/2018.11.19_rx_pwm/HardWareDriver/adns3080/adns3080.h
#include "stm32f4xx.h"

#include "delay.h"
// these pins may be different on different boards
// this is for the uno
//#define PIN_SS        10
//#define PIN_MISO      12
//#define PIN_MOSI      11
//#define PIN_SCK       13

//#define PIN_MOUSECAM_RESET     3
//#define PIN_MOUSECAM_CS        2
struct MD
{
 unsigned char motion;
 char dx, dy;
 unsigned char squal;
 unsigned int shutter;
 unsigned char max_pix;
 int x,y;
};
#define ADNS3080_PIXELS_X                 30
#define ADNS3080_PIXELS_Y                 30

#define ADNS3080_PRODUCT_ID            0x00
#define ADNS3080_REVISION_ID           0x01
#define ADNS3080_MOTION                0x02
#define ADNS3080_DELTA_X               0x03
#define ADNS3080_DELTA_Y               0x04
#define ADNS3080_SQUAL                 0x05
#define ADNS3080_PIXEL_SUM             0x06
#define ADNS3080_MAXIMUM_PIXEL         0x07
#define ADNS3080_CONFIGURATION_BITS    0x0a
#define ADNS3080_EXTENDED_CONFIG       0x0b
#define ADNS3080_DATA_OUT_LOWER        0x0c
#define ADNS3080_DATA_OUT_UPPER        0x0d
#define ADNS3080_SHUTTER_LOWER         0x0e
#define ADNS3080_SHUTTER_UPPER         0x0f
#define ADNS3080_FRAME_PERIOD_LOWER    0x10
#define ADNS3080_FRAME_PERIOD_UPPER    0x11
#define ADNS3080_MOTION_CLEAR          0x12
#define ADNS3080_FRAME_CAPTURE         0x13
#define ADNS3080_SROM_ENABLE           0x14
#define ADNS3080_FRAME_PERIOD_MAX_BOUND_LOWER      0x19
#define ADNS3080_FRAME_PERIOD_MAX_BOUND_UPPER      0x1a
#define ADNS3080_FRAME_PERIOD_MIN_BOUND_LOWER      0x1b
#define ADNS3080_FRAME_PERIOD_MIN_BOUND_UPPER      0x1c
#define ADNS3080_SHUTTER_MAX_BOUND_LOWER           0x1e
#define ADNS3080_SHUTTER_MAX_BOUND_UPPER           0x1e
#define ADNS3080_SROM_ID               0x1f
#define ADNS3080_OBSERVATION           0x3d
#define ADNS3080_INVERSE_PRODUCT_ID    0x3f
#define ADNS3080_PIXEL_BURST           0x40
#define ADNS3080_MOTION_BURST          0x50
#define ADNS3080_SROM_LOAD             0x60

#define ADNS3080_PRODUCT_ID_VAL        0x17

// field of view of ADNS3080 sensor lenses
#define AP_OPTICALFLOW_ADNS3080_08_FOV 0.202458  // 11.6 degrees

// scaler - value returned when sensor is moved equivalent of 1 pixel
#define AP_OPTICALFLOW_ADNS3080_SCALER  1.1
#define OPTFLOW_RESOLUTION 	ADNS3080_RESOLUTION_1600

#define ADNS3080_RESOLUTION_400			400
#define ADNS3080_RESOLUTION_1600		1600

#define FORTYFIVE_DEGREES 0.78539816

//void adns_spi_config(void);
unsigned char SPI_transfer(unsigned char data);
int mousecam_read_reg(int Address);
void mousecam_write_reg(int reg, int val);
//int mousecam_init(void);
int mousecam_frame_capture(unsigned char *pdata);
void mousecam_read_motion(struct MD *p);
int8_t mousecam_init(void);
void adns3080_setup(void);
void adns3080_spi_config(void);
void adns3080_set_resolution(int resolution);
void update_conversion_factors(void);
void adns3080_update_position(float roll, float pitch, float cos_yaw_x, float sin_yaw_y, float altitude);
int get_resolution(void);
void adns3080_getdata(void);
